tap "gcenx/wine"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "majd/repo"
tap "nextdns/tap"
tap "playcover/playcover"
tap "rafaelgarrido/caveats"

brew "aria2"
brew "asdf"
brew "bash"
brew "clamav"
brew "cmake"
brew "colordiff"
brew "coreutils"
brew "curl"
brew "ferium"
brew "ffmpeg"
brew "fswatch"
brew "gcc"
brew "gh"
brew "git", args: ["overwrite"]
brew "make"
brew "mas"
brew "mingw-w64"
brew "mold"
brew "rclone"
brew "shellcheck"
brew "sl"
brew "streamlink"
brew "swtpm"
brew "tmux"
brew "tree"
brew "unar"
brew "vim"
brew "wget"
brew "winetricks"
brew "yt-dlp"
brew "zsh"
brew "nextdns/tap/nextdns"
brew "rafaelgarrido/caveats/brew-caveats"

cask "adobe-creative-cloud-cleaner-tool"
cask "appcleaner"
cask "background-music"
cask "betterdiscord-installer"
cask "blackhole-16ch"
cask "blender", args: { appdir: "/Applications/Blender/latest" }
cask "blobsaver"
cask "brave-browser"
cask "clip-studio-paint"
cask "discord"
cask "docker"
cask "fig"
cask "font-dotgothic16"
cask "font-fira-code-nerd-font"
cask "font-hachi-maru-pop"
cask "google-chrome"
cask "iina"
cask "ipatool"
cask "iterm2"
cask "megasync"
cask "prismlauncher"
cask "protonvpn"
cask "readdle-spark"
cask "sideloadly"
cask "slack"
cask "steam"
cask "syntax-highlight"
cask "touch-bar-simulator"
cask "townwifi"
cask "unofficial-wineskin"
cask "utm"
cask "visual-studio-code"
cask "wine-staging"
cask "xquartz"
cask "zoom"

if Hardware::CPU.arm?
    cask "playcover-prerelease"
end

mas "Create File Menu", id: 1440519779
mas "Orbot", id: 1609461599
mas "Passepartout", id: 1433648537
mas "RunCat", id: 1429033973
mas "Spark", id: 1176895641
