tap "gcenx/wine"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "majd/repo"
tap "rafaelgarrido/caveats"
brew "aria2"
brew "bash"
brew "colordiff"
brew "coreutils"
brew "curl"
brew "ffmpeg"
brew "gcc"
brew "gh"
brew "git", args: ["overwrite"]
brew "make"
brew "mas"
brew "mingw-w64"
brew "shellcheck"
brew "sl"
brew "tmux"
brew "tree"
brew "unar"
brew "vim"
brew "wget"
brew "winetricks"
brew "zsh"
brew "rafaelgarrido/caveats/brew-caveats"
cask "adobe-creative-cloud-cleaner-tool"
cask "appcleaner"
cask "betterdiscord-installer"
cask "blackhole-16ch"
cask "blender", args: { appdir: "/Applications/Blender/latest" }
cask "clip-studio-paint"
cask "discord"
cask "docker"
cask "font-fira-code-nerd-font"
cask "google-chrome"
cask "ipatool"
cask "iterm2"
cask "minecraft"

if Hardware::CPU.arm?
    cask "playcover"
    cask "manymc"
end

cask "protonvpn"
cask "slack"
cask "steam"
cask "syntax-highlight"
cask "unofficial-wineskin"
cask "utm"
cask "visual-studio-code"
cask "wine-staging"
cask "xquartz"
cask "zoom"
cask "zulu"
cask "zulu8"
mas "Create File Menu", id: 1440519779
mas "RunCat", id: 1429033973
mas "Spark", id: 1176895641
